trabalhos_ulbra_2022_02/Programação web/docker-code-main/www/codeigniter4/app/Controllers/Admin/Client.php

SELECT *
FROM `clients`
---
    public function listClients(){
        $ClientModel = new ClientModel();
        $data = [
            'arrayClients' => $ClientModel->findAll(),
        ];

SELECT *
FROM `clients`
WHERE `clients`.`idClient` = '7'
---
    public function updateClient($idClient){
        $ClientModel = new ClientModel();
        $data = [
            'arrayClient' => $ClientModel->find($idClient),
        ];