trabalhos_ulbra_2022_02/Programação web/projeto-as/docker-code-main/www/codeigniter4/app/Controllers/Admin/Client.php

    public function listClients(){
        $data = [
            'clients' => $this->ClientModel->findAll(),
        ];
---
SELECT *
FROM `clients`